import React from 'react';

/**
 * AboutUs component
 * @returns {jsx}
 */
const AboutUs = () => {
  return (
    <div className="container mx-auto px-4 py-8">
      <h1 className="text-4xl font-extrabold text-brand mb-2">Біз туралы</h1>
      <p className="text-lg mb-8">
        Біз <span className="text-brand">STAY BOOKER</span>, сізге бүкіл әлем бойынша қонақүйлерді брондау тәжірибесін ұсынуға тырысатын қызметіне қош келдіңіз. Біздің миссиямыз - сіздің саяхатыңызды жайлы, ыңғайлы және есте қаларлық ету.
      </p>

      <h2 className="text-3xl font-extrabold text-brand mb-2">Біздің көзқарасымыз</h2>
      <p className="text-lg mb-8">
        <span className="text-brand">STAY BOOKER</span>, дүкенінде біз әлемді елестетеміз
        мұнда әрбір саяхатшы өзіне сәйкес келетін тамаша тұрғын үй таба алады
        қажеттіліктер мен артықшылықтар. Біз қонақүйді брондау процесін жеңілдетуге тырысамыз,
        әр бюджетке сәйкес келетін опциялардың кең таңдауын ұсынады.
      </p>

      <h2 className="text-3xl font-extrabold text-brand mb-2">
        Неліктен бізді таңдауыңыз керек?
      </h2>
      <ul className="list-disc ml-6 mb-8">
        <li className="text-lg mb-3">
          Біз қонақүйлердің кең ассортиментін ұсынамыз, люкс курорттарынан бастап интимдік бутиктік қонақүйлерге дейін, сіздің саяхат стиліңізге сәйкес келетін тамаша комбинацияны таба аласыз.
        </li>
        <li className="text-lg mb-3">
          Пайдаланушыға ыңғайлы интерфейсіміз тамаша қонақүйге тапсырыс беруді жылдам әрі оңай етеді. Бірнеше рет басу арқылы сіз еш қиындықсыз брондауыңызды қамтамасыз ете аласыз.
        </li>
        <li className="text-lg mb-3">
          Брондау немесе тұру кезінде туындауы мүмкін кез келген сұрақтар немесе мәселелер бойынша сізге көмектесу үшін біздің арнайы тұтынушыларды қолдау тобы 24/7 жұмыс істейді.
        </li>
        <li className="text-lg mb-3">
          Біз сіздің жеке ақпаратыңыз бен транзакцияларыңыздың қауіпсіздігіне басымдық береміз. Деректеріңіз бізбен қауіпсіз екенін біле отырып, сеніммен брондаңыз.

        </li>
      </ul>      
    </div>
  );
};

export default AboutUs;
